public class A1 {
    private static String[] c;
    private static String[] d;

    static {
        String[] var5 = new String[26];
        int var3 = 0;
        String var2 = "Y¶+wS\u0018\u0011\u0085\fr}£¡\t¶}¾¦\f³O\u0006Xxå\u008dó+\u0007\u0005\u008c§Ï$\u001eÏ\t;¥Nº·Â¸Õ\u000e\u001c¢\b[!÷X\u001aÈ¤ZGy\u0018ó\u0010Îì§6~£\u00ad!«\u0018Ï·µ\u000f«\u001bK_VL¦tÎo4\r%ÕÍ\u000bNö!Öö\u009eÈ¢6 P\bá6<g±\u001aMÅ\nû¢æaXåý5wþ\u0015[\u0011¾k`sò-´ftwf\u0094\u0092pqPþí\u0094\u0006¤\u0093y|R\r\u0010ó\u0012IÆ©\u0085\\ÖxÖ\u0004F\u009c\u0016lZ\u0006\u0006©5\u008bÐ9\u001cM\u00190\u0003\u009a\u001c·@\u0011Kñ[Î·ÊF·¶]\\Îé\u008c#\u00adÞ\u0001\u0097\u0019\f;Ïã¿8\u0085^K)\u001e\u009bø¸ö`ò6vòJ.Ê\u008bkቌk®9\u0086m\u0094sn#\u0083äNÑ\u001cÑ¿\u0083\u0016:¡\u0019Mbü\u009e³\u00104m\u0016\u0097%G®ø\\séí\"\u0000Á\u008c¹¦k\u0091ÁO§K¸èEÖ·C en\u0098°\u0098«Ý¹W[ú®ÖG`ñËhÄûvlý\u0017áq`\u0014*rÀ¤ÉF!ÙØI\f\u000b\u007f~\u0004*]ZÙ¦uæçµ\u0096\u001d5¿\u001b\u0080|ò\u0090'âó@§B\u008cú\u000fbÕ?²c;\u0015\u0018½§ÿ\u0011Uë°\tM×\u0012\u0012|+sKm\u000e\u0001îj\næ\u00142ù_:\u00adw-t\u0013¹§êÔ\u00153\u0010;H[ïº=\u009f\u001f@þ\u0097\u009cYs<E\u001c{1ÜH\u001c\u0019©\u0096\u0090\u0012]/>RëR\u008b%N\u0087÷áØÿ\u0085T¯\u0010æ;\u001a\u001d\u0017Ú¸c9âõò¤\u0090®r\u0088ñWSÊJ\nÙ\u0083Wi3\u0006\t:¶®\u0088Û²ÍJ|\u0005v\n¥9RËb«\u0082é\u001aÅ«\u0092ú\u008c$ó=ßÓgê¨ç×\u0097@¨N\u0004ÕhºÇy\u0005¶?¯^\tÒoc\u0081qð\u008aUÐd\u001d~î\"Øý\u001bðëÐ÷áý½7ÌZË×\u0002Ö\u0012ÓÈ\u009eg\u000f¿þ\u0003öëVq©?'{K\u00013Ä\u0097\"¹e\u00922ÛÛ\u0087s\u0084Ã¾h÷\u0084þ \u009c\u008bB0#»Ø\u0097V\u0085¾¸OÖ3½^rE¹ê\u0000¶c\u00117.9öë@+õÁ\u000f\u001d<\bè²\u0086\u0006½ínD³Â\u0013Cll\u0089»\u000e\u001e(²ÎJqã\u0095~\u008c\u001eà%êú\u001dJ\u009cBNA\u0090\u008a¼\u009f\u009cõ\u009fMÕÒdo3Y\u0085VÏÿÿÁÒ!Æ|ý`¼3~\u0011î\tè\u000b¨À\u0082«Å\u0086¬l\\|¯\u0098\u0096ýc\u007fI\u0014\u009f\u0080\u001c]þÑ<×ó=0\u008bÿ\u0011\u00015|kú;§ãÂçÛáVÜ.ó\u001dÔ\u00938ºù\n¿+~§cR\u0006Ú;\u0013\u000e\u0087Äôé\u0016\u001fÐ\u0084\u008e\u0089aò\u0095]Äâ\u007f¤UÔí\u001d\u0004\u0087\u0093Û\r\u008e×¬\u0015\u008e(\u0094Cn\u000b±¿\u007f$Ï\rk\u0096|öõ}\u0015o\u0083!¨mo\u0012\u0017lüÁ\u0015Ø6\bè#¢&\u009a\u0083\u001f\u008dÖ\u008c2ê{$ÇK¯åò](xF\u0005k\u007fÒF\bg\u000e>0\u000eëI\u0085\u0095àÚÁ<\u0089Üç\u0087_\u009f\u0085;\u0014xªC>ýÐ\u0015s=\u008b\u0091º\u009b\u0004SÎÎ \u0080,á\u0085gÖ\u0017D«æ~U\u0013\u0002\f°\u0096\têW\u008cÀá©\u008cá\u0016\u0011£6\u0081ï\u0007Ö¥µK|ªík\u008dêÎïkÝmGÑ¸ah¿áM\u0095ÏAò9\u008fL±Û°\u001a¬¼Iù\u000eÂO½ÅR\u0001\u0098¸&ÓpØ 3\u001eÔíÞ\u001c\u0088\u00029}Èù\u0005ûp];ît\u0084Ü®\u0087r\u0083:¤Q\u008bé81Ü\u000f½\u008e¿®\u008c\u000eª\u008duòÃ\b ¯äÄô4$\u0005!¥MÕ.\u0084Ü£$[\u00063ÑÎv\u0081d\u0094\u0091\u009dü\u008bg\u0005P\u0080\u000b\u001aÎX\u0093¦\u001eÙ~ëÃ\u000e5\u0085*¬y²ª=X_»`&o\u001c\u0005=½\u0094¹ß\u0089µ¦\u009bG\u0012\u0014òêáò\u0099ÞX^Ê\fàr(\u0096ÖíXÄ\u0087x~7\r®ßÝpJ\u008c»\u0096\u009d+A\u008bëlð:N¢{C©d\u0095Á,Î«ÍM±ëÎy%åõË\u001eû\u0012\u000bÐEÿá\u009dO\rê8´ï[¾\r\u0004<üQ*.TX$\u0000\u0087z\u0095\u007fí\u009f`XTC\u0013âÑÍ\u000b\u0090¶\u0019\u0007)}ÏYn¿\u0016/\u009fÐ¶Ï¯3Ézú<Í¼$Ä\u008eË\",`\u009as¨Â¥%\u0090Ã\t\u0091\u00ad\u0017ÁnM\u0004â6\u0085÷P·á«:Í_)\\ÎÌ\u0005è¨Ù{XÒZLn²\b?©T^cXO\u001e\u0018cã4¾`ÍL\u008bá¶õÙùHÜ`\\Ã\u008f\u007fÅqxFÀ\u0098¾°µÊë\u008f~Ëi)R\u0098ôv\u0015\u0091/í1ù\\\u0084J¬háÞ\u0001\u008c&ï\u0000ù¹\u0011\u0004)%lÓ\u0006×\u009a\u0018½>Ø\u0084S\u0015\u001a$1´70\u00adx\u0084+7û)\u0096ð\u001apô10\u0004g\u0094A|U8\u0096\u0016!÷\u0015×&6\u0002\u0086\"\u0083È\u0086Ëw¹\u00adü\u0018\u0002\u001b\u0098Á¿ywæ¬þÀ\u001a\n\u0004x\u001eÀmpÙ\u00ad\u0082¸È\u0004eã\u000fïñ·\u0019\u008fjW\u0085\u0014A+n\u008b¢Î°\u0011¸\u008bg\u001føÓ\u0018Ë\u0007ÃMµfC¹$;p\u0004B\u008c¸¥ÚÆß }FÅzt}\u0017jÕk\u0016\fÞ\u0016:\\\u0098·+OC\u0002I\u0000¦\u0007\u008e÷\u008cæT«lE2=Ö'k¼\u0019b7zYþ¯×\u00914,\tçc\u007f¶\u008b\u0010Êl\u0099pt\u0097ìÁð/<\u009aàmãÀ¡ÉiðÄá&ª8G\u0003×R\u008dç°\u0001á>ÃRiíÔ\\©ß\u0015©A¢IÇ\u0082q\u001d££s\u0014wU%\u0014\u0097t\u001aóÇ\u0015}»3fyî|+\u0097y\u0018\u0099ç\u0096¥\bKqÍ\u009eÓ¿X/Ò\fÝkêC\u0018JâÄ;>\u0096\u0095}V¡\u0017?º%\u001e)ÉéÖYþ×\u001d¾ß¿j&l¼\u001d\u000b¯\u0001aüKìulæ¨(æ\u0004ÜHCÆøÿÉí\u0099\u009a;\\ñ}k#÷âB/o¡«¸óÐyX\u008b~7àR6.\"\u0083b\u000e»¬x%O1\u008b´7·\u0098MnÏn©/È2w\u0011ZÛì!Éh\u0002\bB\u0092\u0093@hµ\u008b§x2H>R¢\u001c+²SÜ\u001c°¦=BgóZ¿\rØæeû6\u0003\u0093\u009dÃÎI\u008c\u0094!ó¼ôó\u009bâÊ(\u007f0í\u0097c®òè\u0092|ni\u009dºyoLw#\u0099[þ\u0085\u0004~xæ~O\u0003\u009cv:¼\u009e.Ðu²ùÖ\u0091O³ªMhNòÃRN¨°&¬½³;\u0090ª'g\u0005\u008cyZ»û3\f\u009b@©P±×\u00863Cs\u0002\u00167»óÆU<õ«9G\u008b\u0017ëÔRHbc«\u0082J·F*°\u0098\"\u0013»\u0092Üèó\u0007©ò\u009c\u0090\u0091´æyÆ°£f~¨Û=g{^¶|k\u0098\u008bO\u0098\u0003\u0001ñq=\u0090\u0097J¢\u001cë½µø\u00ad-Øn.\u0001Èä\u0088ôê¦\u00976ª¦zÄD°ÚùS\u0082KGÔDbU\u0092@÷Ñry»IÄ.¡â·X\u009d1K\u001fäe\u0013jxsÁ\u0013\u0084VU<ylª\u0089í®§ÕËÍÇuã©\" }Ý\n3\u001cºËÖ¶\u0082\u0002fûÒ³\u001aü¬î\fÚ\u0096¬\u0000\u0010W \u0010 @[cõ½Ã\u008fFl[Ï^\u001e.·A\u0012ÿxÕ©\"ÛÌ¸úeb\"gµ\u0083P±FN\u0010¯4\u008a\u0094âRQ£\u009dÿá\u0096¤*=Ýtý§ &&\u001e\f_\u0094¸\u0091î&\u009eÅ/K~q\u0081d\u000e±Ú_b¡\u0091Ù«´qþ*\u0014\u001b\u0093¹9\u0091;ÂNyÿ³\u000e=¶\u001aÅã¹âSÚHö¦\u0001\u0001{Oz6fô\u0088/\u009e\u008fËç©Ã%\u0003\u0001þ©Hã\u001aÒ\u0018À5YË\u00023\u0095\u00983¹+sÑqEcG\u0018öR]¥Â\"(x©\u0089×\u0013\u0007\u0083V\u0011sÓßúrW\u0019ºaiÀ: ¸§ß\u0019v\u000fÿÜ]ÑÌq\u0001ö\u009a\u0007äY)!,ê¯\u00ad\u0019*\u009e\u0086¶\u0096Ùó\u0085uÞ(=¤Ô(±'0\u008c\u0017ìÁ «\u0088\u0011æ$¸òÅ[ò;\"²òEÄ\u008dêÉ 2ÚÆHiàñ0Vñ¡l\"\rÝ»;\u0087bqå!@\u001e\u0012\u0096Fµ\u007f\u0005SW¼\u001eÃL\u009c*Æ\u008f\u001e´Å\u0080ÙQV;b¥²Y«âI\u009d\u0088ãµaæ_oYD\\?¹\u0098W>u\u0090ÒÚqáÿ\u008b\u0000ãßª$JPê\u0097ºÖ\u0016dHÇN\u001bqèQó»\u0095&-/óú\u007f+@ª\u0010Ýl+]\u007f·\u0084/_%ï\u009eUFð\u0091÷Â\u001bÎü¿\u00ad\u0096½\u007f\u0095K´P\u008c\u009f\u0084üjÁû\u008d)Pb9\u000e-\u009dP¶.¨qjî\u0005CÒü¿é*\u0095\u0002z\u0083\u009bo\u0016\u008dl~Ü\u008c\u0005ßÆ¿Ò\u0016;ï\u0096®\u0085^\u0084cÁ\u001a(\u00938÷!è§¨à(\u0014±qþ\u0007\u0097\u001azÙ\"\u0007\u0018ÖÎÆ§\u000bÜLÃ<lã\u0000¯¯âqb\u0019\u0003<p\u0092\u00891:\f[\u0001\u001cêè?\u0003\u0015êÞ\u0018\u0081\u0086Y+Ð´d/Â@ó\u0002.2f\u0001çúÂT\u0019\u0004?¨\u008bá\u009b¸\u0007GÍ,aÏ\u008e&ù\u009d}\u0083th¿(7 QZ6|/½):ÆgïøÎÄ*\u0012ü¡7¹\u008erS\u001f¼Ò\u001e÷ß4ªÇcôy\u0092V],¯\u009a¥\u0003\u0007´àÓ¦\u0092È\u008c$~\u0087pu'E«´¥¼\u008eÛ\u001c\u0003;¹]Èö²Ðà\u008d4\u0000ÝÖpõæs\u009d2\u009b¦\u0080\u00843nç<ë\u0094¦ujhñ\u001eß¬'\b\u008c(T\u0097\u0093\u0097»ZP$\n\f\u0000\u0093ñ\u0080Wæ\u008c\u00ad\u0016IY\n\u0093¹\u0097´{\u0094d\u0088æ\u008a§{6¨¨rü\u001f\u0095ç¹¸DÁX\u0091ë\u0019Aã:«\u000eÿ}¼\u009bª½\u009d\u008bÊñôv3\u0005i¢\u007f\u0080 Â±\u0090~¥Á\u0086\u0086ÓÌ!b/Ït\nÞ8UY\u001d\u0017ùÎÒm&\u0091Ø(\u001fïÝÏ9)õ\r\u0019'ñ\t\u0017¦+@¼:Oæ'b±+ÄnO;G4\u0093ÓÑ\u000e\u0017ÕÜä|\u00999\rVf\u0095jé$l\u0002t\u001aÍ[]\u0086*\u009aÕ%Rê \u001d{\u008a\u0088\u0012Ôú+GýRô\u000fG4ì*ÐC\u001d\u0000½½!\u0011eBDMÂñFßª®\u009b\u00853N\"30w3å6\u0003²>Ì·\tB\u001f¢¶}êj?\u0000ô\u0085á\u0010d\u0089OëÉh¢q\u0080$\u0087|}\u0093²¥ï\b\naô\u0001\u0084ö|\u008b\u008eEU7\u009f§ÚÏÃJÝñ»Uð\u0095\u0012`\u0084\u0003-n\\1wC\";\u0092t \u009b\u0003\u0003\u0084Ä\rP\u001fÍïBÚ\u009bêõ-wÇ®ïÿ_ô}nkS\u009aÿ\u001dyû¹¦¾\u008e\u0016«Qjy\u008d]n\u0090Æ§5pþ>£p'Y.³\n78éµª£\fN*ö8Ü¼P¹ÏVõ=\u0015£NS\u0088h\u009fKW/ùýÿ!\u0081\u001d\u001cQ¥A\u0012\u001dj\u0083Àvf\u001eúlúÔ3Óä\u0019[\u0099ÍAô&\u0000;\u009cH$B\u009eGL\brü\u001a\u009e±âe\u0097\u0084ìu-\u0005\u0018ð~±SSG\u0016ùü\u00066q\u008dÀý(ê` \u0080\u0011c%ü»}R\u0013\u0088\u0089ÕùÈ¦\u008bóå(FàVÅ.úqý\u0095â)bþ\u009f\u008bøî\u008e\t\u009aä¶~yÄÿw!\u0085\u0095ÓOe\u009cAR\u001aa¶dcù\u0002z¾µ\u0006\u0093ÓÝ¨\u008b\u001e¾xâ\u009fk'¤\u001cÆ¹E0ÄÖ$òøM\u0002½Q0C\u0016´û\u0001\u0006×§\u0014l\u0088\u0016Î\u008cÇbÛjKÄócu\u001c±#ªkÞë\u0015¨\u0097|).Ý\rgÂ\u0001\u008cë\u00827\u00196î\u0015îÑÈÈô!é^%6?~ìRUË\u009b4\u009fGL\\ac\u0087õ\u00956>3pÑL J!T\u0092OS\u0086\u0014¹Ø,t$\u0087l\u0002¹¼¾¼ j\u00ad\u0000GÇ\u0002ÃT\n%iqj[*ÃF\u0087\u0089¾¶vB\rÁ^¤\n¸\u00004®ÉÍ\u009eâ3PT!\u00065_¥[3þ>ºá4ylYeÍÕk\u001f¾ùÝ\u0094{4\u009cVìiÜS°L±ÒA\u001a@\u0087ðÖÖD\u001aádó\u008eM\u0001ÿÍ\u008dAèF\u008a\u00adº\u001f|ärüÈYû4,ýª'\u0001\u0016\u0001ï©W\u00982\u0013.ß>8d \u00054ëà\u0014LfTT\u001d#KV©V&\u000bO\u009dØ\u009c\u0000Ì½Ê7sì\u000ei9IÃ:\u0090Ñ=½\u001dØªÇ±ï\u0082~y3r\u0019åd\u0096S\u001e£è)·Ã\u001a¼ê¿¹Wp\u0016°mãw?[\u0087\u0097\u0005(ÆÆóT5áú\u009en4ß\u0010(â6õd9\u0011þ!h\u0084\u00ad8ºïÎë1j\u0081e·^K·fJâÄä\r\u0016\u00ad´`\u0007µò>ä©Þ%\u0088-7TQ*Áù¼W\u009b\u0080\u001f\u0086=\u0015ÌÃ¼È\fàc\u007fÝ_¸uIDÆ$ñ\u0096×\u0018Õ\u0089Ñâ\u008fiàU¥¾\u009e\u0001\u00176\u0003\u008aô£íøbªê~wÈj\\´q\u0086æ?\u008d=V®PÂ\u0004lµ?³ø©2Ì%\u009eÊÃ\u0001=Îl3vÉ?ÊT<û_?Xô]\u008fò\u0094õ}\nñ'è§ï¿í\u001eâF¤tõ ëÜ5Ñ'oZhÀ\u0084]N}³IØ\u000eEÕrsÏ\u0003ÝÂ\u0001§Zñ¯!Ä_ì1\u00896[ÇTï\u0091\u0094¼Va\u0015Þ\u0089û'KÓÌcfÜ\b\u0097¶í0Ö°¯È\u0087\u001f\u001d]¤\u0082\u0003\u0001\u0086\u0018ðJZKmêÐ7\u0017\u0088Fó\u00845\u0083+¦à\u001aµ\u0007\u0007hèì\u008a>±\bÉã9ô¼XEøm#°ÎC+g\u009c¢Ñî½É\u00146yÉ\u0087·í?¥{Vk\u0014\u0016°\u0012Ã\u0084K\u008fî¡!^³ð\nSðlã].E|ãsap\u0091á,y ¨kG]C!0N\u0092ìv\u0084a!\u0017\u000e_Ç:¨tè:B<\u0089ø×~ª\u0097Í\bìoSPfhu¹\u0084\u001cZåò\u000e\u0094\u0091ºÒ\u00adÅÝCuiðêbÊnú.J©\u009f!\u0013Ì²\u000fq_1çãñÑØ\u0001&#\u0000eôÍ³h\u009cñ\u007fñ8|\u0017M*H\u001f\u0091£\u0087\u008cJ\u0005YRsî½\u0087\u0081Ó\u001caýý¾\u0018\u007f)á\u0018\u009fSQk\u008a ß5d\u001c\u0093â:Ë7ã\fòî\u0005õKr)À\u0095¸´\bÛÁ\u001d`o£gl\u0084n(«XhC±ª3m\u0017×Dp÷{\u00056åÊÛø\u0083gzLý9 \u0003RKãdb1UªÁëË\u001c7ËÔgüëÀI°\u00870\u0094\u009b\u0098e\u0000\u009b\u001cÎ\u008et\u0097®NÖHË¤¢i´\fMþ\u008c\u0002\tw56³Z\u00939?§FÛã2\u0019tÔ\u0080ú\u0012ùL\u0006Èiº>Û\u0085¦º\u0014ä¼|±ÓÐ\b\f\u009de\u0017\u008b´m\bÛ)éx\"£áoØP\u0006\"j¶Þl¬GlºÓÐV\u0018~\r_¶ß\u0014(th¬FI\u000fy\u009eé\u00ad\u008a0ú¸¹iýZÝ¸4\u0005ém\u0001\u0095p\u008dð\u0003\u009a(\u0093ü9\u0002YÁ\u0091\n/\u0010¤×\"ÜTÕÑiÚ(Ë\u0003\bx\u0094×5/\u008cÀÓwé·0¯\n\u001b¼D\u0019°v§þÊ/6®\u00933Ã\u0012PUrü\u0006\u0019Q\u0093·.¡ØQ\u0096ØÀ\u001fAØ\u0090ëÉ\u0082O\u009aa\u008d¦Ñ\u0086[\u0007af»x\u001föÒËi|\u0081E´¹òJ ,ùËàÐ\u0019)/\u0089Ã\u001cùÅo\u0016\u008döÃºîT1Úä½æ\u0089\u0019Ó\u0083\u008d\u0088\u008dò@¼\u0093@©\u000f;\u0093[A\u0003æ\u007f\u008bþ\u0084\"Í~èö>V@ª\u008dÜ²ÇH\u001du\u0011ðF_\u001a+8`ÌC\u00adàð\u0013\u009aÌ(ë\u009b@Ùü\u009dÝè¨®½<3L\"Û»ròçZ\u0096jg\u008bZµèO\u0000@%*\u0082~ñ\u007f\u000ediizÑ¼Ó\u0018\u001dã(ÐNz¸\u0089å²è \u0018d\u001as3w¼jåýh¬u\u000fM0\u0095¹\u0016¸=ÀùåÏq\u0019õq\u009f!_ÄÀØ-ý\u008aÓæi+Lý\u0006Ø\u009e\u000eBâ´¼\u008cæú\u0014N±Ñä1Á\u0083Ú\r<z\f\u008eöe\u0019zI\u0089u\u000b×\u009fB]z\u009a\u0083n·\u0093C!ÍZñVFæ\u0097\u0012z\u008f\u001bÚ1\u001a\u0092\u008bð\u00ad\u0010\u001bÆkÅ/ÔAµÇ±;X4w\tJU»7a³\u001f\u0091Ý\u009fÊ+\u0090#C .U\u0094\u0006|\büb\u000e\fÀeÅý\u007f\n3åî0-\u00805È.¿Q\u009d\u000f#\u0015³\u009cf\u0089\u008bÏ'Ø\u008a\u0080ç»+ôÍ¬wD£Qz\u000e(\u007fn@\fÙå±j£(×Mù\u007fu\u0094OX\u0082\u0096®A\u0090g\u0018Q\u00adÒ©/c\u009c\u0019\u009e\u0002\u0014´\u0007w\u0006²D\u009b&\u008c\u0013\u009a\u0094\u001eJ=0C\u0019t¤þÓÉ&\u0003ê±é\u0002ì\u0000Xl\u0084´*r\u0001 %ª½fG8Ìk \r\u0084T\u0096ò\u0002ãö\u0000«p\\øë\fí!\u0081\fû<\u00adå#\r¥ç÷\"'#\u00adN\u001bÏà©\u0018Íþù4\u0011Ç\u001c\u0017_ìôÍ&$ÿYj\u001e\n9ó\u0012,Ä®ÄWI\u0096µwÕÃM#Ú×\u0097ºöEÈÒ%?\u0090ñl$[ISÿhâ\u0015P\u001c\u0083 é4¡úÐ\u009cýÐl(}Ù¼\u008by\u000f\u0084kõ\u000fëÿAE\u009cä\u001b22\tG¯\u0094\u0011QÅik\u001f\u009d? Wú\u0094ô\u0018ûa*2yü\u009b1Ã\u009e?ou¤ô1\u007fÆ§$ÜTn\u008a/\u0084\u0014çè°â\u001fy¬òË\u0019=r½ \u0099M²\u0017\u0011\u000b\u0089èq¦ý\u0082oÒ$}\u0016Id<Ñ_Ý®H\u0083\"r\u000b\u0007\u0098íÂ\f_1å7ò\u001cqN\r\u0097u\u0004{uÛC\u008e\u0017\u0092|ò\u000eq\u0085\u0087&\u009c%©%á\b+\u0098\u00157\u008e3\u0098Ñ\rÄâr\u009f¬H}sñ\u008c\u001dÏs\u001e%\u001fOi<d0\u0092ø\u0011õá\\\u0087c\u008a&¹}7ç¾7\u0011ÉÖ¯\u009dâánq1";
        int var4 = "Y¶+wS\u0018\u0011\u0085\fr}£¡\t¶}¾¦\f³O\u0006Xxå\u008dó+\u0007\u0005\u008c§Ï$\u001eÏ\t;¥Nº·Â¸Õ\u000e\u001c¢\b[!÷X\u001aÈ¤ZGy\u0018ó\u0010Îì§6~£\u00ad!«\u0018Ï·µ\u000f«\u001bK_VL¦tÎo4\r%ÕÍ\u000bNö!Öö\u009eÈ¢6 P\bá6<g±\u001aMÅ\nû¢æaXåý5wþ\u0015[\u0011¾k`sò-´ftwf\u0094\u0092pqPþí\u0094\u0006¤\u0093y|R\r\u0010ó\u0012IÆ©\u0085\\ÖxÖ\u0004F\u009c\u0016lZ\u0006\u0006©5\u008bÐ9\u001cM\u00190\u0003\u009a\u001c·@\u0011Kñ[Î·ÊF·¶]\\Îé\u008c#\u00adÞ\u0001\u0097\u0019\f;Ïã¿8\u0085^K)\u001e\u009bø¸ö`ò6vòJ.Ê\u008bkቌk®9\u0086m\u0094sn#\u0083äNÑ\u001cÑ¿\u0083\u0016:¡\u0019Mbü\u009e³\u00104m\u0016\u0097%G®ø\\séí\"\u0000Á\u008c¹¦k\u0091ÁO§K¸èEÖ·C en\u0098°\u0098«Ý¹W[ú®ÖG`ñËhÄûvlý\u0017áq`\u0014*rÀ¤ÉF!ÙØI\f\u000b\u007f~\u0004*]ZÙ¦uæçµ\u0096\u001d5¿\u001b\u0080|ò\u0090'âó@§B\u008cú\u000fbÕ?²c;\u0015\u0018½§ÿ\u0011Uë°\tM×\u0012\u0012|+sKm\u000e\u0001îj\næ\u00142ù_:\u00adw-t\u0013¹§êÔ\u00153\u0010;H[ïº=\u009f\u001f@þ\u0097\u009cYs<E\u001c{1ÜH\u001c\u0019©\u0096\u0090\u0012]/>RëR\u008b%N\u0087÷áØÿ\u0085T¯\u0010æ;\u001a\u001d\u0017Ú¸c9âõò¤\u0090®r\u0088ñWSÊJ\nÙ\u0083Wi3\u0006\t:¶®\u0088Û²ÍJ|\u0005v\n¥9RËb«\u0082é\u001aÅ«\u0092ú\u008c$ó=ßÓgê¨ç×\u0097@¨N\u0004ÕhºÇy\u0005¶?¯^\tÒoc\u0081qð\u008aUÐd\u001d~î\"Øý\u001bðëÐ÷áý½7ÌZË×\u0002Ö\u0012ÓÈ\u009eg\u000f¿þ\u0003öëVq©?'{K\u00013Ä\u0097\"¹e\u00922ÛÛ\u0087s\u0084Ã¾h÷\u0084þ \u009c\u008bB0#»Ø\u0097V\u0085¾¸OÖ3½^rE¹ê\u0000¶c\u00117.9öë@+õÁ\u000f\u001d<\bè²\u0086\u0006½ínD³Â\u0013Cll\u0089»\u000e\u001e(²ÎJqã\u0095~\u008c\u001eà%êú\u001dJ\u009cBNA\u0090\u008a¼\u009f\u009cõ\u009fMÕÒdo3Y\u0085VÏÿÿÁÒ!Æ|ý`¼3~\u0011î\tè\u000b¨À\u0082«Å\u0086¬l\\|¯\u0098\u0096ýc\u007fI\u0014\u009f\u0080\u001c]þÑ<×ó=0\u008bÿ\u0011\u00015|kú;§ãÂçÛáVÜ.ó\u001dÔ\u00938ºù\n¿+~§cR\u0006Ú;\u0013\u000e\u0087Äôé\u0016\u001fÐ\u0084\u008e\u0089aò\u0095]Äâ\u007f¤UÔí\u001d\u0004\u0087\u0093Û\r\u008e×¬\u0015\u008e(\u0094Cn\u000b±¿\u007f$Ï\rk\u0096|öõ}\u0015o\u0083!¨mo\u0012\u0017lüÁ\u0015Ø6\bè#¢&\u009a\u0083\u001f\u008dÖ\u008c2ê{$ÇK¯åò](xF\u0005k\u007fÒF\bg\u000e>0\u000eëI\u0085\u0095àÚÁ<\u0089Üç\u0087_\u009f\u0085;\u0014xªC>ýÐ\u0015s=\u008b\u0091º\u009b\u0004SÎÎ \u0080,á\u0085gÖ\u0017D«æ~U\u0013\u0002\f°\u0096\têW\u008cÀá©\u008cá\u0016\u0011£6\u0081ï\u0007Ö¥µK|ªík\u008dêÎïkÝmGÑ¸ah¿áM\u0095ÏAò9\u008fL±Û°\u001a¬¼Iù\u000eÂO½ÅR\u0001\u0098¸&ÓpØ 3\u001eÔíÞ\u001c\u0088\u00029}Èù\u0005ûp];ît\u0084Ü®\u0087r\u0083:¤Q\u008bé81Ü\u000f½\u008e¿®\u008c\u000eª\u008duòÃ\b ¯äÄô4$\u0005!¥MÕ.\u0084Ü£$[\u00063ÑÎv\u0081d\u0094\u0091\u009dü\u008bg\u0005P\u0080\u000b\u001aÎX\u0093¦\u001eÙ~ëÃ\u000e5\u0085*¬y²ª=X_»`&o\u001c\u0005=½\u0094¹ß\u0089µ¦\u009bG\u0012\u0014òêáò\u0099ÞX^Ê\fàr(\u0096ÖíXÄ\u0087x~7\r®ßÝpJ\u008c»\u0096\u009d+A\u008bëlð:N¢{C©d\u0095Á,Î«ÍM±ëÎy%åõË\u001eû\u0012\u000bÐEÿá\u009dO\rê8´ï[¾\r\u0004<üQ*.TX$\u0000\u0087z\u0095\u007fí\u009f`XTC\u0013âÑÍ\u000b\u0090¶\u0019\u0007)}ÏYn¿\u0016/\u009fÐ¶Ï¯3Ézú<Í¼$Ä\u008eË\",`\u009as¨Â¥%\u0090Ã\t\u0091\u00ad\u0017ÁnM\u0004â6\u0085÷P·á«:Í_)\\ÎÌ\u0005è¨Ù{XÒZLn²\b?©T^cXO\u001e\u0018cã4¾`ÍL\u008bá¶õÙùHÜ`\\Ã\u008f\u007fÅqxFÀ\u0098¾°µÊë\u008f~Ëi)R\u0098ôv\u0015\u0091/í1ù\\\u0084J¬háÞ\u0001\u008c&ï\u0000ù¹\u0011\u0004)%lÓ\u0006×\u009a\u0018½>Ø\u0084S\u0015\u001a$1´70\u00adx\u0084+7û)\u0096ð\u001apô10\u0004g\u0094A|U8\u0096\u0016!÷\u0015×&6\u0002\u0086\"\u0083È\u0086Ëw¹\u00adü\u0018\u0002\u001b\u0098Á¿ywæ¬þÀ\u001a\n\u0004x\u001eÀmpÙ\u00ad\u0082¸È\u0004eã\u000fïñ·\u0019\u008fjW\u0085\u0014A+n\u008b¢Î°\u0011¸\u008bg\u001føÓ\u0018Ë\u0007ÃMµfC¹$;p\u0004B\u008c¸¥ÚÆß }FÅzt}\u0017jÕk\u0016\fÞ\u0016:\\\u0098·+OC\u0002I\u0000¦\u0007\u008e÷\u008cæT«lE2=Ö'k¼\u0019b7zYþ¯×\u00914,\tçc\u007f¶\u008b\u0010Êl\u0099pt\u0097ìÁð/<\u009aàmãÀ¡ÉiðÄá&ª8G\u0003×R\u008dç°\u0001á>ÃRiíÔ\\©ß\u0015©A¢IÇ\u0082q\u001d££s\u0014wU%\u0014\u0097t\u001aóÇ\u0015}»3fyî|+\u0097y\u0018\u0099ç\u0096¥\bKqÍ\u009eÓ¿X/Ò\fÝkêC\u0018JâÄ;>\u0096\u0095}V¡\u0017?º%\u001e)ÉéÖYþ×\u001d¾ß¿j&l¼\u001d\u000b¯\u0001aüKìulæ¨(æ\u0004ÜHCÆøÿÉí\u0099\u009a;\\ñ}k#÷âB/o¡«¸óÐyX\u008b~7àR6.\"\u0083b\u000e»¬x%O1\u008b´7·\u0098MnÏn©/È2w\u0011ZÛì!Éh\u0002\bB\u0092\u0093@hµ\u008b§x2H>R¢\u001c+²SÜ\u001c°¦=BgóZ¿\rØæeû6\u0003\u0093\u009dÃÎI\u008c\u0094!ó¼ôó\u009bâÊ(\u007f0í\u0097c®òè\u0092|ni\u009dºyoLw#\u0099[þ\u0085\u0004~xæ~O\u0003\u009cv:¼\u009e.Ðu²ùÖ\u0091O³ªMhNòÃRN¨°&¬½³;\u0090ª'g\u0005\u008cyZ»û3\f\u009b@©P±×\u00863Cs\u0002\u00167»óÆU<õ«9G\u008b\u0017ëÔRHbc«\u0082J·F*°\u0098\"\u0013»\u0092Üèó\u0007©ò\u009c\u0090\u0091´æyÆ°£f~¨Û=g{^¶|k\u0098\u008bO\u0098\u0003\u0001ñq=\u0090\u0097J¢\u001cë½µø\u00ad-Øn.\u0001Èä\u0088ôê¦\u00976ª¦zÄD°ÚùS\u0082KGÔDbU\u0092@÷Ñry»IÄ.¡â·X\u009d1K\u001fäe\u0013jxsÁ\u0013\u0084VU<ylª\u0089í®§ÕËÍÇuã©\" }Ý\n3\u001cºËÖ¶\u0082\u0002fûÒ³\u001aü¬î\fÚ\u0096¬\u0000\u0010W \u0010 @[cõ½Ã\u008fFl[Ï^\u001e.·A\u0012ÿxÕ©\"ÛÌ¸úeb\"gµ\u0083P±FN\u0010¯4\u008a\u0094âRQ£\u009dÿá\u0096¤*=Ýtý§ &&\u001e\f_\u0094¸\u0091î&\u009eÅ/K~q\u0081d\u000e±Ú_b¡\u0091Ù«´qþ*\u0014\u001b\u0093¹9\u0091;ÂNyÿ³\u000e=¶\u001aÅã¹âSÚHö¦\u0001\u0001{Oz6fô\u0088/\u009e\u008fËç©Ã%\u0003\u0001þ©Hã\u001aÒ\u0018À5YË\u00023\u0095\u00983¹+sÑqEcG\u0018öR]¥Â\"(x©\u0089×\u0013\u0007\u0083V\u0011sÓßúrW\u0019ºaiÀ: ¸§ß\u0019v\u000fÿÜ]ÑÌq\u0001ö\u009a\u0007äY)!,ê¯\u00ad\u0019*\u009e\u0086¶\u0096Ùó\u0085uÞ(=¤Ô(±'0\u008c\u0017ìÁ «\u0088\u0011æ$¸òÅ[ò;\"²òEÄ\u008dêÉ 2ÚÆHiàñ0Vñ¡l\"\rÝ»;\u0087bqå!@\u001e\u0012\u0096Fµ\u007f\u0005SW¼\u001eÃL\u009c*Æ\u008f\u001e´Å\u0080ÙQV;b¥²Y«âI\u009d\u0088ãµaæ_oYD\\?¹\u0098W>u\u0090ÒÚqáÿ\u008b\u0000ãßª$JPê\u0097ºÖ\u0016dHÇN\u001bqèQó»\u0095&-/óú\u007f+@ª\u0010Ýl+]\u007f·\u0084/_%ï\u009eUFð\u0091÷Â\u001bÎü¿\u00ad\u0096½\u007f\u0095K´P\u008c\u009f\u0084üjÁû\u008d)Pb9\u000e-\u009dP¶.¨qjî\u0005CÒü¿é*\u0095\u0002z\u0083\u009bo\u0016\u008dl~Ü\u008c\u0005ßÆ¿Ò\u0016;ï\u0096®\u0085^\u0084cÁ\u001a(\u00938÷!è§¨à(\u0014±qþ\u0007\u0097\u001azÙ\"\u0007\u0018ÖÎÆ§\u000bÜLÃ<lã\u0000¯¯âqb\u0019\u0003<p\u0092\u00891:\f[\u0001\u001cêè?\u0003\u0015êÞ\u0018\u0081\u0086Y+Ð´d/Â@ó\u0002.2f\u0001çúÂT\u0019\u0004?¨\u008bá\u009b¸\u0007GÍ,aÏ\u008e&ù\u009d}\u0083th¿(7 QZ6|/½):ÆgïøÎÄ*\u0012ü¡7¹\u008erS\u001f¼Ò\u001e÷ß4ªÇcôy\u0092V],¯\u009a¥\u0003\u0007´àÓ¦\u0092È\u008c$~\u0087pu'E«´¥¼\u008eÛ\u001c\u0003;¹]Èö²Ðà\u008d4\u0000ÝÖpõæs\u009d2\u009b¦\u0080\u00843nç<ë\u0094¦ujhñ\u001eß¬'\b\u008c(T\u0097\u0093\u0097»ZP$\n\f\u0000\u0093ñ\u0080Wæ\u008c\u00ad\u0016IY\n\u0093¹\u0097´{\u0094d\u0088æ\u008a§{6¨¨rü\u001f\u0095ç¹¸DÁX\u0091ë\u0019Aã:«\u000eÿ}¼\u009bª½\u009d\u008bÊñôv3\u0005i¢\u007f\u0080 Â±\u0090~¥Á\u0086\u0086ÓÌ!b/Ït\nÞ8UY\u001d\u0017ùÎÒm&\u0091Ø(\u001fïÝÏ9)õ\r\u0019'ñ\t\u0017¦+@¼:Oæ'b±+ÄnO;G4\u0093ÓÑ\u000e\u0017ÕÜä|\u00999\rVf\u0095jé$l\u0002t\u001aÍ[]\u0086*\u009aÕ%Rê \u001d{\u008a\u0088\u0012Ôú+GýRô\u000fG4ì*ÐC\u001d\u0000½½!\u0011eBDMÂñFßª®\u009b\u00853N\"30w3å6\u0003²>Ì·\tB\u001f¢¶}êj?\u0000ô\u0085á\u0010d\u0089OëÉh¢q\u0080$\u0087|}\u0093²¥ï\b\naô\u0001\u0084ö|\u008b\u008eEU7\u009f§ÚÏÃJÝñ»Uð\u0095\u0012`\u0084\u0003-n\\1wC\";\u0092t \u009b\u0003\u0003\u0084Ä\rP\u001fÍïBÚ\u009bêõ-wÇ®ïÿ_ô}nkS\u009aÿ\u001dyû¹¦¾\u008e\u0016«Qjy\u008d]n\u0090Æ§5pþ>£p'Y.³\n78éµª£\fN*ö8Ü¼P¹ÏVõ=\u0015£NS\u0088h\u009fKW/ùýÿ!\u0081\u001d\u001cQ¥A\u0012\u001dj\u0083Àvf\u001eúlúÔ3Óä\u0019[\u0099ÍAô&\u0000;\u009cH$B\u009eGL\brü\u001a\u009e±âe\u0097\u0084ìu-\u0005\u0018ð~±SSG\u0016ùü\u00066q\u008dÀý(ê` \u0080\u0011c%ü»}R\u0013\u0088\u0089ÕùÈ¦\u008bóå(FàVÅ.úqý\u0095â)bþ\u009f\u008bøî\u008e\t\u009aä¶~yÄÿw!\u0085\u0095ÓOe\u009cAR\u001aa¶dcù\u0002z¾µ\u0006\u0093ÓÝ¨\u008b\u001e¾xâ\u009fk'¤\u001cÆ¹E0ÄÖ$òøM\u0002½Q0C\u0016´û\u0001\u0006×§\u0014l\u0088\u0016Î\u008cÇbÛjKÄócu\u001c±#ªkÞë\u0015¨\u0097|).Ý\rgÂ\u0001\u008cë\u00827\u00196î\u0015îÑÈÈô!é^%6?~ìRUË\u009b4\u009fGL\\ac\u0087õ\u00956>3pÑL J!T\u0092OS\u0086\u0014¹Ø,t$\u0087l\u0002¹¼¾¼ j\u00ad\u0000GÇ\u0002ÃT\n%iqj[*ÃF\u0087\u0089¾¶vB\rÁ^¤\n¸\u00004®ÉÍ\u009eâ3PT!\u00065_¥[3þ>ºá4ylYeÍÕk\u001f¾ùÝ\u0094{4\u009cVìiÜS°L±ÒA\u001a@\u0087ðÖÖD\u001aádó\u008eM\u0001ÿÍ\u008dAèF\u008a\u00adº\u001f|ärüÈYû4,ýª'\u0001\u0016\u0001ï©W\u00982\u0013.ß>8d \u00054ëà\u0014LfTT\u001d#KV©V&\u000bO\u009dØ\u009c\u0000Ì½Ê7sì\u000ei9IÃ:\u0090Ñ=½\u001dØªÇ±ï\u0082~y3r\u0019åd\u0096S\u001e£è)·Ã\u001a¼ê¿¹Wp\u0016°mãw?[\u0087\u0097\u0005(ÆÆóT5áú\u009en4ß\u0010(â6õd9\u0011þ!h\u0084\u00ad8ºïÎë1j\u0081e·^K·fJâÄä\r\u0016\u00ad´`\u0007µò>ä©Þ%\u0088-7TQ*Áù¼W\u009b\u0080\u001f\u0086=\u0015ÌÃ¼È\fàc\u007fÝ_¸uIDÆ$ñ\u0096×\u0018Õ\u0089Ñâ\u008fiàU¥¾\u009e\u0001\u00176\u0003\u008aô£íøbªê~wÈj\\´q\u0086æ?\u008d=V®PÂ\u0004lµ?³ø©2Ì%\u009eÊÃ\u0001=Îl3vÉ?ÊT<û_?Xô]\u008fò\u0094õ}\nñ'è§ï¿í\u001eâF¤tõ ëÜ5Ñ'oZhÀ\u0084]N}³IØ\u000eEÕrsÏ\u0003ÝÂ\u0001§Zñ¯!Ä_ì1\u00896[ÇTï\u0091\u0094¼Va\u0015Þ\u0089û'KÓÌcfÜ\b\u0097¶í0Ö°¯È\u0087\u001f\u001d]¤\u0082\u0003\u0001\u0086\u0018ðJZKmêÐ7\u0017\u0088Fó\u00845\u0083+¦à\u001aµ\u0007\u0007hèì\u008a>±\bÉã9ô¼XEøm#°ÎC+g\u009c¢Ñî½É\u00146yÉ\u0087·í?¥{Vk\u0014\u0016°\u0012Ã\u0084K\u008fî¡!^³ð\nSðlã].E|ãsap\u0091á,y ¨kG]C!0N\u0092ìv\u0084a!\u0017\u000e_Ç:¨tè:B<\u0089ø×~ª\u0097Í\bìoSPfhu¹\u0084\u001cZåò\u000e\u0094\u0091ºÒ\u00adÅÝCuiðêbÊnú.J©\u009f!\u0013Ì²\u000fq_1çãñÑØ\u0001&#\u0000eôÍ³h\u009cñ\u007fñ8|\u0017M*H\u001f\u0091£\u0087\u008cJ\u0005YRsî½\u0087\u0081Ó\u001caýý¾\u0018\u007f)á\u0018\u009fSQk\u008a ß5d\u001c\u0093â:Ë7ã\fòî\u0005õKr)À\u0095¸´\bÛÁ\u001d`o£gl\u0084n(«XhC±ª3m\u0017×Dp÷{\u00056åÊÛø\u0083gzLý9 \u0003RKãdb1UªÁëË\u001c7ËÔgüëÀI°\u00870\u0094\u009b\u0098e\u0000\u009b\u001cÎ\u008et\u0097®NÖHË¤¢i´\fMþ\u008c\u0002\tw56³Z\u00939?§FÛã2\u0019tÔ\u0080ú\u0012ùL\u0006Èiº>Û\u0085¦º\u0014ä¼|±ÓÐ\b\f\u009de\u0017\u008b´m\bÛ)éx\"£áoØP\u0006\"j¶Þl¬GlºÓÐV\u0018~\r_¶ß\u0014(th¬FI\u000fy\u009eé\u00ad\u008a0ú¸¹iýZÝ¸4\u0005ém\u0001\u0095p\u008dð\u0003\u009a(\u0093ü9\u0002YÁ\u0091\n/\u0010¤×\"ÜTÕÑiÚ(Ë\u0003\bx\u0094×5/\u008cÀÓwé·0¯\n\u001b¼D\u0019°v§þÊ/6®\u00933Ã\u0012PUrü\u0006\u0019Q\u0093·.¡ØQ\u0096ØÀ\u001fAØ\u0090ëÉ\u0082O\u009aa\u008d¦Ñ\u0086[\u0007af»x\u001föÒËi|\u0081E´¹òJ ,ùËàÐ\u0019)/\u0089Ã\u001cùÅo\u0016\u008döÃºîT1Úä½æ\u0089\u0019Ó\u0083\u008d\u0088\u008dò@¼\u0093@©\u000f;\u0093[A\u0003æ\u007f\u008bþ\u0084\"Í~èö>V@ª\u008dÜ²ÇH\u001du\u0011ðF_\u001a+8`ÌC\u00adàð\u0013\u009aÌ(ë\u009b@Ùü\u009dÝè¨®½<3L\"Û»ròçZ\u0096jg\u008bZµèO\u0000@%*\u0082~ñ\u007f\u000ediizÑ¼Ó\u0018\u001dã(ÐNz¸\u0089å²è \u0018d\u001as3w¼jåýh¬u\u000fM0\u0095¹\u0016¸=ÀùåÏq\u0019õq\u009f!_ÄÀØ-ý\u008aÓæi+Lý\u0006Ø\u009e\u000eBâ´¼\u008cæú\u0014N±Ñä1Á\u0083Ú\r<z\f\u008eöe\u0019zI\u0089u\u000b×\u009fB]z\u009a\u0083n·\u0093C!ÍZñVFæ\u0097\u0012z\u008f\u001bÚ1\u001a\u0092\u008bð\u00ad\u0010\u001bÆkÅ/ÔAµÇ±;X4w\tJU»7a³\u001f\u0091Ý\u009fÊ+\u0090#C .U\u0094\u0006|\büb\u000e\fÀeÅý\u007f\n3åî0-\u00805È.¿Q\u009d\u000f#\u0015³\u009cf\u0089\u008bÏ'Ø\u008a\u0080ç»+ôÍ¬wD£Qz\u000e(\u007fn@\fÙå±j£(×Mù\u007fu\u0094OX\u0082\u0096®A\u0090g\u0018Q\u00adÒ©/c\u009c\u0019\u009e\u0002\u0014´\u0007w\u0006²D\u009b&\u008c\u0013\u009a\u0094\u001eJ=0C\u0019t¤þÓÉ&\u0003ê±é\u0002ì\u0000Xl\u0084´*r\u0001 %ª½fG8Ìk \r\u0084T\u0096ò\u0002ãö\u0000«p\\øë\fí!\u0081\fû<\u00adå#\r¥ç÷\"'#\u00adN\u001bÏà©\u0018Íþù4\u0011Ç\u001c\u0017_ìôÍ&$ÿYj\u001e\n9ó\u0012,Ä®ÄWI\u0096µwÕÃM#Ú×\u0097ºöEÈÒ%?\u0090ñl$[ISÿhâ\u0015P\u001c\u0083 é4¡úÐ\u009cýÐl(}Ù¼\u008by\u000f\u0084kõ\u000fëÿAE\u009cä\u001b22\tG¯\u0094\u0011QÅik\u001f\u009d? Wú\u0094ô\u0018ûa*2yü\u009b1Ã\u009e?ou¤ô1\u007fÆ§$ÜTn\u008a/\u0084\u0014çè°â\u001fy¬òË\u0019=r½ \u0099M²\u0017\u0011\u000b\u0089èq¦ý\u0082oÒ$}\u0016Id<Ñ_Ý®H\u0083\"r\u000b\u0007\u0098íÂ\f_1å7ò\u001cqN\r\u0097u\u0004{uÛC\u008e\u0017\u0092|ò\u000eq\u0085\u0087&\u009c%©%á\b+\u0098\u00157\u008e3\u0098Ñ\rÄâr\u009f¬H}sñ\u008c\u001dÏs\u001e%\u001fOi<d0\u0092ø\u0011õá\\\u0087c\u008a&¹}7ç¾7\u0011ÉÖ¯\u009dâánq1".length();
        char var1 = '\b';
        int var0 = -1;

        while(true) {
            int var7;
            int var8;
            char[] var10;
            char[] var10000;
            char[] var10001;
            int var10002;
            int var10003;
            char var10004;
            byte var10005;
            label83: {
                ++var0;
                var10000 = var2.substring(var0, var0 + var1).toCharArray();
                var10002 = var10000.length;
                var7 = 0;
                var10001 = var10000;
                var8 = var10002;
                if (var10002 <= 1) {
                    var10 = var10000;
                    var10003 = var7;
                } else {
                    var10001 = var10000;
                    var8 = var10002;
                    if (var10002 <= var7) {
                        break label83;
                    }

                    var10 = var10000;
                    var10003 = var7;
                }

                while(true) {
                    var10004 = var10[var10003];
                    switch(var7 % 7) {
                        case 0:
                            var10005 = 121;
                            break;
                        case 1:
                            var10005 = 71;
                            break;
                        case 2:
                            var10005 = 73;
                            break;
                        case 3:
                            var10005 = 64;
                            break;
                        case 4:
                            var10005 = 63;
                            break;
                        case 5:
                            var10005 = 109;
                            break;
                        default:
                            var10005 = 17;
                    }

                    var10[var10003] = (char)(var10004 ^ var10005);
                    ++var7;
                    if (var8 == 0) {
                        var10003 = var8;
                        var10 = var10001;
                    } else {
                        if (var8 <= var7) {
                            break;
                        }

                        var10 = var10001;
                        var10003 = var7;
                    }
                }
            }

            var5[var3++] = (new String(var10001)).intern();
            if ((var0 += var1) >= var4) {
                var2 = "¿en\u0089DûØÀ\u0099ä\u000f\u0090d,°º±;Ë}\u0098Bóë\n\u0014";
                var4 = "¿en\u0089DûØÀ\u0099ä\u000f\u0090d,°º±;Ë}\u0098Bóë\n\u0014".length();
                var1 = '\n';
                var0 = -1;

                while(true) {
                    label62: {
                        ++var0;
                        var10000 = var2.substring(var0, var0 + var1).toCharArray();
                        var10002 = var10000.length;
                        var7 = 0;
                        var10001 = var10000;
                        var8 = var10002;
                        if (var10002 <= 1) {
                            var10 = var10000;
                            var10003 = var7;
                        } else {
                            var10001 = var10000;
                            var8 = var10002;
                            if (var10002 <= var7) {
                                break label62;
                            }

                            var10 = var10000;
                            var10003 = var7;
                        }

                        while(true) {
                            var10004 = var10[var10003];
                            switch(var7 % 7) {
                                case 0:
                                    var10005 = 121;
                                    break;
                                case 1:
                                    var10005 = 71;
                                    break;
                                case 2:
                                    var10005 = 73;
                                    break;
                                case 3:
                                    var10005 = 64;
                                    break;
                                case 4:
                                    var10005 = 63;
                                    break;
                                case 5:
                                    var10005 = 109;
                                    break;
                                default:
                                    var10005 = 17;
                            }

                            var10[var10003] = (char)(var10004 ^ var10005);
                            ++var7;
                            if (var8 == 0) {
                                var10003 = var8;
                                var10 = var10001;
                            } else {
                                if (var8 <= var7) {
                                    break;
                                }

                                var10 = var10001;
                                var10003 = var7;
                            }
                        }
                    }

                    var5[var3++] = (new String(var10001)).intern();
                    if ((var0 += var1) >= var4) {   // 修改
                        A1.c = var5;
                        A1.d = new String[26];
                        break;
                    }

                    var1 = var2.charAt(var0);
                }
            }

            var1 = var2.charAt(var0);
        }
    }

    public static void main(String[] args){

    }

}

